_posts/2014-11-16-firefox-to-org.html
---
layout: post
title:  "Bookmarks: From Firefox to org-mode"
date:   2014-11-16
categories:
---

<p>
I decided to migrating bookmarks from Firefox to org-more for multiple reasons (it's easier to add metadata, open them with different browsers, search, etc.). I started out simply copy-pasting the title, then the url, and maybe open the link to remember what it is and add some metadata into a hierarchical org-mode list, but it seemed incredibly repetitive.
</p>

<p>
I then tried exporting the bookmarks, but the output file was some ugly html. Rather than try to read it, I opened it up in a browser and saw a nice representation of what I'd love to copy into org-mode, though there wouldn't be an easy way to copy links. Now, I could have opened the html file in some REPL (Python, Clojure, etc.) and parsed out the titles and links, but I was hoping for something easier. I also could have used JavaScript to print the links out on the screen, but then I'd still have to format it after I copied it into Emacs. And even if I didn't, that's still too much work.
</p>

<p>
What I ended up doing was opening the html file with eww, and wrote a function that copies the title and the link into the right format (using the same functions I use when editing text). Here are the functions:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">my/firefox-bookmark-eww-to-org-list</span> <span style="color: #8c8c8c;">()</span>&#57344;&#57345;&#57345;
  <span style="color: #036A07;">"convert a link representation of a firefox bookmark read from eww to that</span>&#57344;&#57345;&#57345;
<span style="color: #036A07;">of an org mode list"</span>&#57344;&#57345;&#57345;
  <span style="color: #8c8c8c;">(</span>interactive<span style="color: #8c8c8c;">)</span>&#57344;&#57345;&#57345;
  <span style="color: #8c8c8c;">(</span>delete-horizontal-space<span style="color: #8c8c8c;">)</span>&#57344;&#57345;&#57345;
  <span style="color: #8c8c8c;">(</span>shr-copy-url<span style="color: #8c8c8c;">)</span>&#57344;&#57345;&#57345;
  <span style="color: #8c8c8c;">(</span>insert <span style="color: #008000;">"- "</span><span style="color: #8c8c8c;">)</span>&#57344;&#57345;&#57345;
  <span style="color: #8c8c8c;">(</span>end-of-line<span style="color: #8c8c8c;">)</span>&#57344;&#57345;&#57345;
  <span style="color: #8c8c8c;">(</span>insert <span style="color: #008000;">"\n  - "</span><span style="color: #8c8c8c;">)</span>&#57344;&#57345;&#57345;
  <span style="color: #8c8c8c;">(</span>yank<span style="color: #8c8c8c;">))</span>&#57344;&#57345;&#57345;
&#57344;&#57345;&#57345;
<span style="color: #8c8c8c;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">my/firefox-bookmark-eww-to-org-list+next-line</span> <span style="color: #8c8c8c;">()</span>&#57344;&#57345;&#57345;
  <span style="color: #036A07;">"same as my/firefox-bookmark-eww-to-org-list, but moving to the next line</span>&#57344;&#57345;&#57345;
<span style="color: #036A07;">afterwards (useful with #'repeat)"</span>&#57344;&#57345;&#57345;
  <span style="color: #8c8c8c;">(</span>interactive<span style="color: #8c8c8c;">)</span>&#57344;&#57345;&#57345;
  <span style="color: #8c8c8c;">(</span>my/firefox-bookmark-eww-to-org-list<span style="color: #8c8c8c;">)</span>&#57344;&#57345;&#57345;
  <span style="color: #8c8c8c;">(</span>move-beginning-of-line nil<span style="color: #8c8c8c;">)</span>&#57344;&#57345;&#57345;
  <span style="color: #8c8c8c;">(</span>next-logical-line<span style="color: #8c8c8c;">))</span>&#57344;&#57345;&#57345;
</pre>
</div>

<p>
A few minutes later, I had all my bookmarks in Emacs. How people can live with text editors without a browser is beyond me (just kidding).
</p>
